ConnectTest/src/InformationRegisters/classMembers/classMembers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>classMembers</name>
  <resources>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>class</name>
    <type>
      <types>CatalogRef.classesSchedule</types>
    </type>
  </dimensions>
  <dimensions>
    <name>uid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/InformationRegisters/classMembers/ManagerModule.bsl
Function attributesStructure() Export
	
	attributesTable = data.getValueTable();
	attributesTableForNewItem = data.getValueTable();
	
	data.addRowInAttributesTable(attributesTable, "uid", "uid", "string");
	data.addRowInAttributesTable(attributesTable, "class", "class", "ref");

	classStruct = New Structure();
	classStruct.Insert("classesSchedule", "uid");

	mdStruct = New Structure();
	mdStruct.Insert("class", classStruct);

	Return New Structure("mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", "classMembers", "informationRegister", "write", attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
